benchmark.log
INFO 07-31 17:33:18 [__init__.py:244] Automatically detected platform rocm.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f9eebf06c00>, seed=0, num_prompts=10, dataset_name='random', dataset_path=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=128, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, endpoint_type='openai', label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', max_concurrency=None, model='/workspace/llama_3.1_70B', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=10.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None)
INFO 07-31 17:33:31 [datasets.py:355] Sampling input_len from [127, 127] and output_len from [256, 256]
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 10.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
============ Serving Benchmark Result ============
Successful requests:                     10        
Benchmark duration (s):                  37.01     
Total input tokens:                      1270      
Total generated tokens:                  1822      
Request throughput (req/s):              0.27      
Output token throughput (tok/s):         49.23     
Total Token throughput (tok/s):          83.54     
---------------Time to First Token----------------
Mean TTFT (ms):                          246.57    
Median TTFT (ms):                        238.59    
P99 TTFT (ms):                           323.83    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          141.26    
Median TPOT (ms):                        139.88    
P99 TPOT (ms):                           152.03    
---------------Inter-token Latency----------------
Mean ITL (ms):                           139.89    
Median ITL (ms):                         139.46    
P99 ITL (ms):                            156.73    
==================================================